{"config": [{"config": {"kernel_size": [3, 3], "kernel_constraint": null, "trainable": true, "filters": 16, "padding": "same", "bias_constraint": null, "batch_input_shape": [null, null, null, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "dtype": "float32", "data_format": "channels_last", "bias_regularizer": null, "name": "conv2d_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "trainable": true, "filters": 16, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_2", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "rate": 0.1, "trainable": true}, "class_name": "Dropout"}, {"config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "trainable": true, "filters": 32, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_3", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "trainable": true, "filters": 32, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_4", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "trainable": true, "filters": 64, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_5", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"kernel_size": [3, 3], "kernel_constraint": null, "trainable": true, "filters": 64, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "conv2d_6", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "dropout_3", "rate": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "global_average_pooling2d_1", "data_format": "channels_last", "trainable": true}, "class_name": "GlobalAveragePooling2D"}, {"config": {"units": 500, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_4", "rate": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 10, "kernel_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Sequential"}